#+TITLE: Plan for Feedback Portal
#+AUTHOR: VLEAD
#+DATE: [2018-01-18 Wednesday]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export

* Introduction
  - This document contains the realization plan for
    Feedback Portal.

* Milestones Snapshot

  |---+-------+----+-----+-------------------------------------------------+------+--------+-----+-----+--------|
  |   | S.    | Mi | Req | Milestone                                       | Plan | Status | Est | Act | Issues |
  |   | no    | no | Map |                                                 |      |        | hrs | hrs |        |
  |---+-------+----+-----+-------------------------------------------------+------+--------+-----+-----+--------|
  |   | 1.    | [[https://github.com/virtual-labs/vlabs-about/milestone/1][1]]  |     | [[https://github.com/vlead/feedback-portal/milestone/2][Feedback portal with footer service integration]] | [[Feedback portal with footer service integration][ref]]  | Close  | 34  | 30  | [[https://github.com/virtual-labs/vlabs-about/milestone/1?closed=1][ref]]    |
  |---+-------+----+-----+-------------------------------------------------+------+--------+-----+-----+--------|
  |   | Total |    |     |                                                 |      |        | 34  | 30  |        |
  | ^ |       |    |     |                                                 |      |        | est | act |        |
  |---+-------+----+-----+-------------------------------------------------+------+--------+-----+-----+--------|
  #+TBLFM: @3$8=remote(tbl-rlz-pln-ml-1,$est)
  #+TBLFM: @3$9=remote(tbl-rlz-pln-ml-1,$act)
  #+TBLFM: $act=vsum(@II+1..@-1)
  #+TBLFM: $est=vsum(@II+1..@-1)

* Detailed Plan 
** Feedback portal with footer service Integration
#+caption:  realization-plan-milestone-1
#+name: tbl-rlz-pln-ml-1
|---+-------+---------------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |    S. | Tasks                     | Github | Expected | Actual |  Estimated |     Actual | Status | Assignee  |
|   |    NO |                           | Issues | Effort   | Effort |     Start, |     Start/ |        |           |
|   |       |                           |        | (in      | (in    |        End |        End |        |           |
|   |       |                           |        | person   | person |      Dates |      Dates |        |           |
|   |       |                           |        | hours)   | hours) |            |            |        |           |
|---+-------+---------------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |    1. | Remove header and footer  | [[https://github.com/vlead/feedback-portal/issues/54][#54]]    | 16       | 14     | 22-01-2018 | 22-01-2018 | Done   | Balamma   |
|   |       | from feedback portal      |        |          |        | 24-01-2018 | 24-01-2018 |        | Mrudhvika |
|---+-------+---------------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |    2. | ADS deployment has broken | [[https://github.com/vlead/feedback-portal/issues/55][#55]]    | 08       | 06     | 23-01-2018 | 23-01-2018 | Done   | Sripathi  |
|   |       | "Expression of            |        |          |        | 24-01-2018 | 24-01-2018 |        | Balamma   |
|   |       | Interest for Workshops"   |        |          |        |            |            |        |           |
|   |       | page into org file        |        |          |        |            |            |        |           |
|---+-------+---------------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |    3. | migrate deployment        | [[https://github.com/vlead/feedback-portal/issues/56][#56]]    | 10       | 10     | 23-01-2018 | 23-01-2018 | Done   | Sripathi  |
|   |       | from ubuntu12.04 to       |        |          |        | 24-01-2018 | 23-01-2018 |        | Balamma   |
|   |       | ubuntu14.04               |        |          |        |            |            |        |           |
|---+-------+---------------------------+--------+----------+--------+------------+------------+--------+-----------|
|   | Total |                           |        | 34       | 30     |            |            |        |           |
| ^ |       |                           |        | est      | act    |            |            |        |           |
|---+-------+---------------------------+--------+----------+--------+------------+------------+--------+-----------|
#+TBLFM: $est=vsum(@II+1..@-1)
#+TBLFM: $act=vsum(@II+1..@-1)

